# LayoutRuleClearSpacing Properties

---
The LayoutRuleClearSpacing type exposes the following members.
| Name| Description
---|---|---
| IsReadOnly| Identifies if the object is read-only or modifiable.(Inherited from APIObject)
| JustifyType| Get or set the type of justification.
| Spacing| Get or set the spacing of the beam system.
Top
#### Reference
LayoutRuleClearSpacing Class
Autodesk.Revit.DB Namespace